devdnl/dnx-rtos/src/system/drivers/uart/stm32f1/uart.c
/*=========================================================================*//**
@file    uart.c

@author  Daniel Zorychta

@brief   This file support USART peripherals

@note    Copyright (C) 2012 Daniel Zorychta <daniel.zorychta@gmail.com>

         This program is free software; you can redistribute it and/or modify
         it under the terms of the GNU General Public License as published by
         the  Free Software  Foundation;  either version 2 of the License, or
         any later version.

         This  program  is  distributed  in the hope that  it will be useful,
         but  WITHOUT  ANY  WARRANTY;  without  even  the implied warranty of
         MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
         GNU General Public License for more details.

         You  should  have received a copy  of the GNU General Public License
         along  with  this  program;  if not,  write  to  the  Free  Software
         Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA.


*//*==========================================================================*/

#ifdef __cplusplus
extern "C" {
#endif

/*==============================================================================
  Include files
==============================================================================*/
#include "system/dnxmodule.h"
#include "system/thread.h"
#include "stm32f1/uart_cfg.h"
#include "stm32f1/uart_def.h"
#include "stm32f1/stm32f10x.h"
#include "stm32f1/lib/stm32f10x_rcc.h"
#include <unistd.h>

/*==============================================================================
  Local symbolic constants/macros
==============================================================================*/
#define RELEASE_TIMEOUT                         100
#define TX_WAIT_TIMEOUT                         MAX_DELAY
#define RX_WAIT_TIMEOUT                         MAX_DELAY
#define MTX_BLOCK_TIMEOUT                       MAX_DELAY

/*==============================================================================
  Local types, enums definitions
==============================================================================*/
/* irq configuration */
struct irq_cfg {
        IRQn_Type irqn;
        u32_t     priority;
};

/* USART handling structure */
struct UART_data {
        struct Rx_FIFO {
                u8_t            buffer[_UART_RX_BUFFER_SIZE];
                u16_t           buffer_level;
                u16_t           read_index;
                u16_t           write_index;
        } Rx_FIFO;

        struct Tx_buffer {
                const u8_t     *src_ptr;
                size_t          data_size;
        } Tx_buffer;

        sem_t                  *data_write_sem;
        sem_t                  *data_read_sem;
        mutex_t                *port_lock_rx_mtx;
        mutex_t                *port_lock_tx_mtx;
        u8_t                    major;
        struct UART_config      config;
};

/*==============================================================================
  Local function prototypes
==============================================================================*/
static stdret_t uart_turn_on            (USART_t *uart);
static stdret_t uart_turn_off           (USART_t *uart);
static void     configure_uart          (u8_t major, struct UART_config *config);
static bool     fifo_write              (struct Rx_FIFO *fifo, u8_t *data);
static bool     fifo_read               (struct Rx_FIFO *fifo, u8_t *data);
static void     handle_irq              (u8_t major);

/*==============================================================================
  Local object definitions
==============================================================================*/
/* addresses of UART devices */
static USART_t *const uart[_UART_NUMBER] = {
        #if defined(RCC_APB2ENR_USART1EN) && (_UART1_ENABLE > 0)
        USART1,
        #endif
        #if defined(RCC_APB1ENR_USART2EN) && (_UART2_ENABLE > 0)
        USART2,
        #endif
        #if defined(RCC_APB1ENR_USART3EN) && (_UART3_ENABLE > 0)
        USART3,
        #endif
        #if defined(RCC_APB1ENR_UART4EN)  && (_UART4_ENABLE > 0)
        UART4,
        #endif
        #if defined(RCC_APB1ENR_UART5EN)  && (_UART5_ENABLE > 0)
        UART5,
        #endif
};

/* irq configuration */
static const struct irq_cfg uart_irq[_UART_NUMBER] = {
        #if defined(RCC_APB2ENR_USART1EN) && (_UART1_ENABLE > 0)
        {.irqn = USART1_IRQn, .priority = _UART1_IRQ_PRIORITY},
        #endif
        #if defined(RCC_APB1ENR_USART2EN) && (_UART2_ENABLE > 0)
        {.irqn = USART2_IRQn, .priority = _UART2_IRQ_PRIORITY},
        #endif
        #if defined(RCC_APB1ENR_USART3EN) && (_UART3_ENABLE > 0)
        {.irqn = USART3_IRQn, .priority = _UART3_IRQ_PRIORITY},
        #endif
        #if defined(RCC_APB1ENR_UART4EN)  && (_UART4_ENABLE > 0)
        {.irqn = UART4_IRQn, .priority = _UART4_IRQ_PRIORITY},
        #endif
        #if defined(RCC_APB1ENR_UART5EN)  && (_UART5_ENABLE > 0)
        {.irqn = UART5_IRQn, .priority = _UART5_IRQ_PRIORITY}
        #endif
};

/* uart default configuration */
static const struct UART_config uart_default_config = {
        .parity             = _UART_DEFAULT_PARITY,
        .stop_bits          = _UART_DEFAULT_STOP_BITS,
        .LIN_break_length   = _UART_DEFAULT_LIN_BREAK_LEN,
        .tx_enable          = _UART_DEFAULT_TX_ENABLE,
        .rx_enable          = _UART_DEFAULT_RX_ENABLE,
        .LIN_mode_enable    = _UART_DEFAULT_LIN_MODE_ENABLE,
        .hardware_flow_ctrl = _UART_DEFAULT_HW_FLOW_CTRL,
        .single_wire_mode   = _UART_DEFAULT_SINGLE_WIRE_MODE,
        .baud               = _UART_DEFAULT_BAUD
};

/* structure which identify USARTs data in the IRQs */
static struct UART_data *uart_data[_UART_NUMBER];

/*==============================================================================
  Function definitions
==============================================================================*/

//==============================================================================
/**
 * @brief Initialize device
 *
 * @param[out]          **device_handle        device allocated memory
 * @param[in ]            major                major device number
 * @param[in ]            minor                minor device number
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_INIT(UART, void **device_handle, u8_t major, u8_t minor)
{
        UNUSED_ARG(minor);

        STOP_IF(device_handle == NULL);

        if (major >= _UART_NUMBER || minor != _UART_MINOR_NUMBER) {
                errno = EINVAL;
                return STD_RET_ERROR;
        }

        uart_data[major] = calloc(1, sizeof(struct UART_data));
        if (uart_data[major]) {

                uart_data[major]->data_write_sem   = semaphore_new(1, 1);
                uart_data[major]->data_read_sem    = semaphore_new(_UART_RX_BUFFER_SIZE, 0);
                uart_data[major]->port_lock_rx_mtx = mutex_new(MUTEX_NORMAL);
                uart_data[major]->port_lock_tx_mtx = mutex_new(MUTEX_NORMAL);

                if (  uart_data[major]->data_write_sem
                   && uart_data[major]->data_read_sem
                   && uart_data[major]->port_lock_rx_mtx
                   && uart_data[major]->port_lock_tx_mtx) {

                        uart_data[major]->major  = major;
                        uart_data[major]->config = uart_default_config;

                        NVIC_EnableIRQ(uart_irq[major].irqn);
                        NVIC_SetPriority(uart_irq[major].irqn, uart_irq[major].priority);
                        uart_turn_on(uart[major]);
                        configure_uart(major, (struct UART_config *)&uart_default_config);

                        *device_handle = uart_data[major];

