devdnl/dnx-rtos/src/system/drivers/uart/stm32f1/uart.c
                        return STD_RET_OK;
                } else {
                        if (uart_data[major]->data_write_sem) {
                                semaphore_delete(uart_data[major]->data_write_sem);
                        }

                        if (uart_data[major]->data_read_sem) {
                                semaphore_delete(uart_data[major]->data_read_sem);
                        }

                        if (uart_data[major]->port_lock_rx_mtx) {
                                mutex_delete(uart_data[major]->port_lock_rx_mtx);
                        }

                        if (uart_data[major]->port_lock_tx_mtx) {
                                mutex_delete(uart_data[major]->port_lock_tx_mtx);
                        }

                        free(uart_data[major]);
                        uart_data[major] = NULL;
                }
        }

        return STD_RET_ERROR;
}

//==============================================================================
/**
 * @brief Release device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_RELEASE(UART, void *device_handle)
{
        STOP_IF(device_handle == NULL);

        struct UART_data *hdl = device_handle;

        if (mutex_lock(hdl->port_lock_rx_mtx, RELEASE_TIMEOUT)) {
                if (mutex_lock(hdl->port_lock_tx_mtx, RELEASE_TIMEOUT)) {

                        critical_section_begin();

                        mutex_unlock(hdl->port_lock_rx_mtx);
                        mutex_unlock(hdl->port_lock_tx_mtx);

                        mutex_delete(hdl->port_lock_rx_mtx);
                        mutex_delete(hdl->port_lock_tx_mtx);

                        semaphore_delete(hdl->data_write_sem);
                        uart_turn_off(uart[hdl->major]);

                        uart_data[hdl->major] = NULL;
                        free(hdl);

                        critical_section_end();

                        return STD_RET_OK;
                }

                mutex_unlock(hdl->port_lock_rx_mtx);
        }

        errno = EBUSY;
        return STD_RET_ERROR;
}

//==============================================================================
/**
 * @brief Open device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           flags                  file operation flags (O_RDONLY, O_WRONLY, O_RDWR)
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_OPEN(UART, void *device_handle, int flags)
{
        UNUSED_ARG(flags);
        STOP_IF(device_handle == NULL);

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Close device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           force                  device force close (true)
 * @param[in ]          *opened_by_task         task with opened this device (valid only if force is true)
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_CLOSE(UART, void *device_handle, bool force, const task_t *opened_by_task)
{
        UNUSED_ARG(force);
        UNUSED_ARG(opened_by_task);

        STOP_IF(device_handle == NULL);

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Write data to device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]          *src                    data source
 * @param[in ]           count                  number of bytes to write
 * @param[in ][out]     *fpos                   file position
 *
 * @return number of written bytes, -1 if error
 */
//==============================================================================
API_MOD_WRITE(UART, void *device_handle, const u8_t *src, size_t count, u64_t *fpos)
{
        UNUSED_ARG(fpos);

        STOP_IF(device_handle == NULL);
        STOP_IF(src == NULL);
        STOP_IF(count == 0);

        struct UART_data *hdl = device_handle;

        ssize_t n = 0;
        if (mutex_lock(hdl->port_lock_tx_mtx, MTX_BLOCK_TIMEOUT)) {
                hdl->Tx_buffer.src_ptr   = src;
                hdl->Tx_buffer.data_size = count;

                SET_BIT(uart[hdl->major]->CR1, USART_CR1_TXEIE);
                semaphore_wait(hdl->data_write_sem, TX_WAIT_TIMEOUT);

                n = count - hdl->Tx_buffer.data_size;

                mutex_unlock(hdl->port_lock_tx_mtx);
        } else {
                errno = EBUSY;
                n     = -1;
        }

        return n;
}

//==============================================================================
/**
 * @brief Read data from device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *dst                    data destination
 * @param[in ]           count                  number of bytes to read
 * @param[in ][out]     *fpos                   file position
 *
 * @return number of read bytes, -1 if error
 */
//==============================================================================
API_MOD_READ(UART, void *device_handle, u8_t *dst, size_t count, u64_t *fpos)
{
        UNUSED_ARG(fpos);

        STOP_IF(device_handle == NULL);
        STOP_IF(dst == NULL);
        STOP_IF(count == 0);

        struct UART_data *hdl = device_handle;

        ssize_t n = 0;
        if (mutex_lock(hdl->port_lock_rx_mtx, MTX_BLOCK_TIMEOUT)) {
                while (count--) {
                        if (semaphore_wait(hdl->data_read_sem, RX_WAIT_TIMEOUT)) {
                                CLEAR_BIT(uart[hdl->major]->CR1, USART_CR1_RXNEIE);
                                if (fifo_read(&hdl->Rx_FIFO, dst)) {
                                        dst++;
                                        n++;
                                }
                                SET_BIT(uart[hdl->major]->CR1, USART_CR1_RXNEIE);
                        }
                }

