devdnl/dnx-rtos/src/system/drivers/uart/stm32f1/uart.c
                mutex_unlock(hdl->port_lock_rx_mtx);
        } else {
                errno = EBUSY;
                n     = -1;
        }

        return n;
}

//==============================================================================
/**
 * @brief IO control
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           request                request
 * @param[in ][out]     *arg                    request's argument
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_IOCTL(UART, void *device_handle, int request, void *arg)
{
        STOP_IF(device_handle == NULL);

        struct UART_data *hdl    = device_handle;
        stdret_t          status = STD_RET_OK;

        if (arg) {
                switch (request) {
                case UART_IORQ_SET_CONFIGURATION:
                        configure_uart(hdl->major, arg);
                        hdl->config = *(struct UART_config *)arg;
                        break;

                case UART_IORQ_GET_CONFIGURATION:
                        *(struct UART_config *)arg = hdl->config;
                        break;

                case UART_IORQ_GET_CHAR_UNBLOCKING:
                        if (!fifo_read(&hdl->Rx_FIFO, arg)) {
                             errno  = EAGAIN;
                             status = STD_RET_ERROR;
                        }
                        break;

                default:
                        errno  = EBADRQC;
                        status = STD_RET_ERROR;
                        break;
                }
        } else {
                errno  = EINVAL;
                status = STD_RET_ERROR;
        }

        return status;
}

//==============================================================================
/**
 * @brief Flush device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_FLUSH(UART, void *device_handle)
{
        STOP_IF(device_handle == NULL);

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Device information
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *device_stat            device status
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_STAT(UART, void *device_handle, struct vfs_dev_stat *device_stat)
{
        STOP_IF(device_handle == NULL);
        STOP_IF(device_stat == NULL);

        device_stat->st_size  = 0;
        device_stat->st_major = 0;
        device_stat->st_minor = 0;

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Function enable USART clock
 *
 * @param[in] *USART            peripheral address
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t uart_turn_on(USART_t *USART)
{
        switch ((u32_t)USART) {
        #if defined(RCC_APB2ENR_USART1EN) && (_UART1_ENABLE > 0)
        case USART1_BASE:
                SET_BIT(RCC->APB2RSTR, RCC_APB2RSTR_USART1RST);
                CLEAR_BIT(RCC->APB2RSTR, RCC_APB2RSTR_USART1RST);
                SET_BIT(RCC->APB2ENR, RCC_APB2ENR_USART1EN);
                break;
        #endif
        #if defined(RCC_APB1ENR_USART2EN) && (_UART2_ENABLE > 0)
        case USART2_BASE:
                SET_BIT(RCC->APB1RSTR, RCC_APB1RSTR_USART2RST);
                CLEAR_BIT(RCC->APB1RSTR, RCC_APB1RSTR_USART2RST);
                SET_BIT(RCC->APB1ENR, RCC_APB1ENR_USART2EN);
                break;
        #endif
        #if defined(RCC_APB1ENR_USART3EN) && (_UART3_ENABLE > 0)
        case USART3_BASE:
                SET_BIT(RCC->APB1RSTR, RCC_APB1RSTR_USART3RST);
                CLEAR_BIT(RCC->APB1RSTR, RCC_APB1RSTR_USART3RST);
                SET_BIT(RCC->APB1ENR, RCC_APB1ENR_USART3EN);
                break;
        #endif
        #if defined(RCC_APB1ENR_UART4EN)  && (_UART4_ENABLE > 0)
        case UART4_BASE:
                SET_BIT(RCC->APB1RSTR, RCC_APB1RSTR_UART4RST);
                CLEAR_BIT(RCC->APB1RSTR, RCC_APB1RSTR_UART4RST);
                SET_BIT(RCC->APB1ENR, RCC_APB1ENR_UART4EN);
                break;
        #endif
        #if defined(RCC_APB1ENR_UART5EN)  && (_UART5_ENABLE > 0)
        case UART5_BASE:
                SET_BIT(RCC->APB1RSTR, RCC_APB1RSTR_UART5RST);
                CLEAR_BIT(RCC->APB1RSTR, RCC_APB1RSTR_UART5RST);
                SET_BIT(RCC->APB1ENR, RCC_APB1ENR_UART5EN);
                break;
        #endif
        default:
                errno = EIO;
                return STD_RET_ERROR;
        }

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Function disable USART clock
 *
 * @param[in] *USART            peripheral address
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t uart_turn_off(USART_t *USART)
{
        switch ((u32_t)USART) {
        #if defined(RCC_APB2ENR_USART1EN) && (_UART1_ENABLE > 0)
        case USART1_BASE:
                NVIC_DisableIRQ(USART1_IRQn);
                SET_BIT(RCC->APB2RSTR, RCC_APB2RSTR_USART1RST);
                CLEAR_BIT(RCC->APB2RSTR, RCC_APB2RSTR_USART1RST);
                CLEAR_BIT(RCC->APB2ENR, RCC_APB2ENR_USART1EN);
                break;
        #endif
        #if defined(RCC_APB1ENR_USART2EN) && (_UART2_ENABLE > 0)
        case USART2_BASE:
                NVIC_DisableIRQ(USART2_IRQn);
                SET_BIT(RCC->APB1RSTR, RCC_APB1RSTR_USART2RST);
                CLEAR_BIT(RCC->APB1RSTR, RCC_APB1RSTR_USART2RST);
                CLEAR_BIT(RCC->APB1ENR, RCC_APB1ENR_USART2EN);
                break;
        #endif
        #if defined(RCC_APB1ENR_USART3EN) && (_UART3_ENABLE > 0)
        case USART3_BASE:
                NVIC_DisableIRQ(USART3_IRQn);
                SET_BIT(RCC->APB1RSTR, RCC_APB1RSTR_USART3RST);
                CLEAR_BIT(RCC->APB1RSTR, RCC_APB1RSTR_USART3RST);
                CLEAR_BIT(RCC->APB1ENR, RCC_APB1ENR_USART3EN);
                break;
        #endif
        #if defined(RCC_APB1ENR_UART4EN)  && (_UART4_ENABLE > 0)
        case UART4_BASE:
                NVIC_DisableIRQ(UART4_IRQn);
                SET_BIT(RCC->APB1RSTR, RCC_APB1RSTR_UART4RST);
                CLEAR_BIT(RCC->APB1RSTR, RCC_APB1RSTR_UART4RST);
                CLEAR_BIT(RCC->APB1ENR, RCC_APB1ENR_UART4EN);
                break;
        #endif
        #if defined(RCC_APB1ENR_UART5EN)  && (_UART5_ENABLE > 0)
        case UART5_BASE:
                NVIC_DisableIRQ(UART5_IRQn);
                SET_BIT(RCC->APB1RSTR, RCC_APB1RSTR_UART5RST);
                CLEAR_BIT(RCC->APB1RSTR, RCC_APB1RSTR_UART5RST);
                CLEAR_BIT(RCC->APB1ENR, RCC_APB1ENR_UART5EN);
                break;
        #endif
        default:
                errno = EIO;
                return STD_RET_ERROR;
        }

