devdnl/dnx-rtos/src/system/drivers/uart/stm32f1/uart.c
        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Function configure selected UART
 *
 * @param major         major device number
 * @param config        configuration structure
 */
//==============================================================================
static void configure_uart(u8_t major, struct UART_config *config)
{
        USART_t *UART = uart[major];

        /* set baud */
        RCC_ClocksTypeDef freq;
        RCC_GetClocksFreq(&freq);

        u32_t PCLK;
        if ((u32_t)UART == USART1_BASE) {
                PCLK = freq.PCLK2_Frequency;
        } else {
                PCLK = freq.PCLK1_Frequency;
        }

        UART->BRR = (PCLK / (config->baud)) + 1;

        /* set 8 bit word length and wake idle line */
        CLEAR_BIT(UART->CR1, USART_CR1_M | USART_CR1_WAKE);

        /* set parity */
        switch (config->parity) {
        case UART_PARITY_OFF:
                CLEAR_BIT(UART->CR1, USART_CR1_PCE);
                break;
        case UART_PARITY_EVEN:
                SET_BIT(UART->CR1, USART_CR1_PCE);
                CLEAR_BIT(UART->CR1, USART_CR1_PS);
                break;
        case UART_PARITY_ODD:
                SET_BIT(UART->CR1, USART_CR1_PCE);
                SET_BIT(UART->CR1, USART_CR1_PS);
                break;
        }

        /* transmitter enable */
        if (config->tx_enable) {
                SET_BIT(UART->CR1, USART_CR1_TE);
        } else {
                CLEAR_BIT(UART->CR1, USART_CR1_TE);
        }

        /* receiver enable */
        if (config->rx_enable) {
                SET_BIT(UART->CR1, USART_CR1_RE);
        } else {
                CLEAR_BIT(UART->CR1, USART_CR1_RE);
        }

        /* enable LIN if configured */
        if (config->LIN_mode_enable) {
                SET_BIT(UART->CR2, USART_CR2_LINEN);
        } else {
                CLEAR_BIT(UART->CR2, USART_CR2_LINEN);
        }

        /* configure stop bits */
        if (config->stop_bits == UART_STOP_BIT_1) {
                CLEAR_BIT(UART->CR2, USART_CR2_STOP);
        } else {
                CLEAR_BIT(UART->CR2, USART_CR2_STOP);
                SET_BIT(UART->CR2, USART_CR2_STOP_1);
        }

        /* clock configuration (synchronous mode) */
        CLEAR_BIT(UART->CR2, USART_CR2_CLKEN | USART_CR2_CPOL | USART_CR2_CPHA | USART_CR2_LBCL);

        /* LIN break detection length */
        if (config->LIN_break_length == UART_LIN_BREAK_10_BITS) {
                CLEAR_BIT(UART->CR2, USART_CR2_LBDL);
        } else {
                SET_BIT(UART->CR2, USART_CR2_LBDL);
        }

        /* hardware flow control */
        if (config->hardware_flow_ctrl) {
                SET_BIT(UART->CR3, USART_CR3_CTSE | USART_CR3_RTSE);
        } else {
                CLEAR_BIT(UART->CR3, USART_CR3_CTSE | USART_CR3_RTSE);
        }

        /* configure single wire mode */
        if (config->single_wire_mode) {
                SET_BIT(UART->CR3, USART_CR3_HDSEL);
        } else {
                CLEAR_BIT(UART->CR3, USART_CR3_HDSEL);
        }

        /* enable RXNE interrupt */
        SET_BIT(UART->CR1, USART_CR1_RXNEIE);

        /* enable UART */
        SET_BIT(UART->CR1, USART_CR1_UE);
}

//==============================================================================
/**
 * @brief Function write data to FIFO
 *
 * @param fifo          fifo buffer
 * @param data          data to write
 *
 * @return true if success, false on error
 */
//==============================================================================
static bool fifo_write(struct Rx_FIFO *fifo, u8_t *data)
{
        if (fifo->buffer_level < _UART_RX_BUFFER_SIZE) {
                fifo->buffer[fifo->write_index++] = *data;

                if (fifo->write_index >= _UART_RX_BUFFER_SIZE) {
                        fifo->write_index = 0;
                }

                fifo->buffer_level++;

                return true;
        } else {
                return false;
        }
}

//==============================================================================
/**
 * @brief Function read data from FIFO
 *
 * @param fifo          fifo buffer
 * @param data          data result
 *
 * @return true if success, false on error
 */
//==============================================================================
static bool fifo_read(struct Rx_FIFO *fifo, u8_t *data)
{
        if (fifo->buffer_level > 0) {
                *data = fifo->buffer[fifo->read_index++];

                if (fifo->read_index >= _UART_RX_BUFFER_SIZE) {
                        fifo->read_index = 0;
                }

                fifo->buffer_level--;

                return true;
        } else {
                return false;
        }
}

//==============================================================================
/**
 * @brief Interrupt handling
 *
 * @param major         major device number
 */
//==============================================================================
static void handle_irq(u8_t major)
{
        USART_t *UART = uart[major];

        /* receiver interrupt handler */
        if ((UART->CR1 & USART_CR1_RXNEIE) && (UART->SR & (USART_SR_RXNE | USART_SR_ORE))) {
                u8_t DR = UART->DR;

                if (fifo_write(&uart_data[major]->Rx_FIFO, &DR)) {
                        semaphore_signal_from_ISR(uart_data[major]->data_read_sem, NULL);
                }
        }

        /* transmitter interrupt handler */
        if ((UART->CR1 & USART_CR1_TXEIE) && (UART->SR & USART_SR_TXE)) {

                if (uart_data[major]->Tx_buffer.data_size && uart_data[major]->Tx_buffer.src_ptr) {
                        UART->DR = *(uart_data[major]->Tx_buffer.src_ptr++);

                        if (--uart_data[major]->Tx_buffer.data_size == 0) {
                                UART->SR = ~USART_SR_TC;
                                SET_BIT(UART->CR1, USART_CR1_TCIE);
                                CLEAR_BIT(UART->CR1, USART_CR1_TXEIE);
                                uart_data[major]->Tx_buffer.src_ptr = NULL;
                        }
                } else {
                        /* this shall never happen */
                        CLEAR_BIT(UART->CR1, USART_CR1_TXEIE);
                        semaphore_signal_from_ISR(uart_data[major]->data_write_sem, NULL);
                }
        } else if ((UART->CR1 & USART_CR1_TCIE) && (UART->SR & USART_SR_TC)) {

                CLEAR_BIT(UART->CR1, USART_CR1_TCIE);
                semaphore_signal_from_ISR(uart_data[major]->data_write_sem, NULL);
        }
}

//==============================================================================
/**
 * @brief USART1 Interrupt
 */
//==============================================================================
#if defined(RCC_APB2ENR_USART1EN) && (_UART1_ENABLE > 0)
void USART1_IRQHandler(void)
{
        handle_irq(_UART1);
}
#endif

//==============================================================================
/**
 * @brief USART2 Interrupt
 */
//==============================================================================
#if defined(RCC_APB1ENR_USART2EN) && (_UART2_ENABLE > 0)
void USART2_IRQHandler(void)
{
        handle_irq(_UART2);
}
#endif

//==============================================================================
/**
 * @brief USART3 Interrupt
 */
//==============================================================================
#if defined(RCC_APB1ENR_USART3EN) && (_UART3_ENABLE > 0)
void USART3_IRQHandler(void)
{
        handle_irq(_UART3);
}
#endif

//==============================================================================
/**
 * @brief UART4 Interrupt
 */
//==============================================================================
#if defined(RCC_APB1ENR_UART4EN) && (_UART4_ENABLE > 0)
void UART4_IRQHandler(void)
{
        handle_irq(_UART4);
}
#endif

//==============================================================================
/**
 * @brief UART5 Interrupt
 */
//==============================================================================
#if defined(RCC_APB1ENR_UART5EN) && (_UART5_ENABLE > 0)
void UART5_IRQHandler(void)
{
        handle_irq(_UART5);
}
#endif

#ifdef __cplusplus
}
#endif

/*==============================================================================
  End of file
==============================================================================*/
